read_verilog ../../commonlib/fifomem.v
read_verilog ../../commonlib/sync_2ff.v
read_verilog ../rtl/async_fifo.v

hierarchy -check -top async_fifo
proc; opt; fsm; opt; memory; opt
techmap; opt
synth

tee -o report_std.txt stat
